let handler = async (m, { conn, command, text }) => {
    if (!text) return conn.reply(m.chat, 'حط اسم', m);
    let personalidad = `
┏━━°❀❬ *تحليل الشخصية* ❭❀°━━┓
*┃*
*┃• الاسم* : ${text}
*┃• الأخلاق الحميدة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• الأخلاق السيئة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• نوع الشخص* : ${pickRandom(['طيب القلب','دمه عسل','بخيل','كريم','تافهه,','قليل ادب','خاين','مز/ه','متواضع','سامج','غبي','خجول','جبان','فضولي','محبوب','كريم' ])}
*┃• دائما* : ${pickRandom(['متوتر','سيء','مشتت','مزعج','نمام','خطير','كثير كلام','همج','بيكدب','طبعه شمات😣','ماسك الفون'])}
*┃• الذكاء* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• الانحراف* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• الشجاعة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• الخوف* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• شهرة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
┗━━━━━━━━━━━━━━━━
`;
    let { key } = await conn.sendMessage(m.chat, { text: "جاري تحليل الشخصية...", mentions: conn.parseMention(personalidad) }, { quoted: m });
    await loading(conn, m, personalidad, key);
}

async function loading(conn, m, response, key) {
    var hawemod = [
        "《 █▒▒▒▒▒▒▒▒▒▒▒》10%",
        "《 ████▒▒▒▒▒▒▒▒》30%",
        "《 ███████▒▒▒▒▒》50%",
        "《 ██████████▒▒》80%",
        "《 ████████████》100%"
    ];
    for (let i = 0; i < hawemod.length; i++) {
        await new Promise(resolve => setTimeout(resolve, 1000));
        await conn.sendMessage(m.chat, { text: hawemod[i], edit: key, mentions: conn.parseMention(response) }, { quoted: m });
    }
    await conn.sendMessage(m.chat, { text: response, edit: key, mentions: conn.parseMention(response) }, { quoted: m });
}

handler.help = ['personalidad *<nombre>*'];
handler.tags = ['fun'];
handler.command = /^شخصية|الشخصيه|الشخصية|شخصيه/i;

export default handler;

function pickRandom(list) {
    return list[Math.floor(Math.random() * list.length)];
}